chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usbhs/processor/usbhs_p32mz1024ecm124.h
PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USBHS_GlobalInterruptEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_GlobalInterruptEnable_Unsupported(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USBHS_GlobalInterruptDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_GlobalInterruptDisable_Unsupported(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResumeEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResumeEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResumeDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResumeDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SuspendEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SuspendEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SuspendDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SuspendDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResetEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResetEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResetDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResetDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API USBHS_VBUS_LEVEL PLIB_USBHS_VBUSLevelGet(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_VBUSLevelGet_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (USBHS_VBUS_LEVEL)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_HostModeIsEnabled(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_HostModeIsEnabled_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SessionEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SessionEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SessionDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SessionDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceAddressSet(USBHS_MODULE_ID index, uint8_t address)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceAddressSet_Default(index, address);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceAttach(USBHS_MODULE_ID index, uint32_t speed)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceAttach_Default(index, speed);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceDetach(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceDetach_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_ExistsModuleControl(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_ExistsModuleControl_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_USBHS_EP0StatusGet(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_EP0StatusGet_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0StatusClear(USBHS_MODULE_ID index, USBHS_EP0_ERROR error)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0StatusClear_Default(index, error);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0SentStallClear(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0SentStallClear_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0INHandshakeSend(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0INHandshakeSend_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0INTokenSend(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0INTokenSend_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0OUTHandshakeSend(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0OUTHandshakeSend_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0INHandshakeClear(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0INHandshakeClear_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0StallEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0StallEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EP0StallDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EP0StallDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

